Revit 2027 API
BuiltInFailures.CopyPasteFailures.CannotPasteNoWorkplane Property
 Can't paste because there is no corresponding Work Plane. Set workplane or switch to view with appropriate workplane.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotPasteNoWorkplane { get; }
Public Shared ReadOnly Property CannotPasteNoWorkplane As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotPasteNoWorkplane {
	FailureDefinitionId^ get ();
}
static member CannotPasteNoWorkplane : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace